#include<stdio.h>

/*4.45
A.没有，如果REG是%rsp的话入栈的是%rsp-8而不是%rsp
B.
movq REG,-8(%rsp)
subq $8,%rsp
*/


/*4.46
A.不是，如果REG是%rsp，该段代码序列使%rsp的值为(%rsp)+8，而指令popq%rsp执行后，%rsp的值应为(%rsp)。
B.
addq $8,%rsp
movq -8(%rsp),REG
*/

/*4.51
------------------------------------------
阶段              iaddq V,rB
------------------------------------------
取指               icode：ifun <--M1[PC]
                   rA:rB<--M1[PC+1]
                   valC<--M8[PC+2]
                   valP<--PC+10
------------------------------------------
译码                valB<--R[rB]
------------------------------------------
执行                valE<--valC+valB
                    set CC
------------------------------------------
访存    
------------------------------------------
写回                R[rB]<--valE
------------------------------------------
更新PC              PC<--valP
*/