/*6.27
A.标记位：0x45 地址范围：0x08A4~0x08A7
标记位：0x38   地址范围：0x0704~0x0707
B.地址范围：0x1238~0x123B
*/

/*6.31
A.
12 11 10 9 8 7 6 5 4 3 2 1 0
-----------------------------
0  0  1  1 1 0 0 0 1 1 0 1 0
B.
CO                  0x02
CI                  0x06
CT                  0x38
高速缓存命中？       是
返回的高速缓存字节   0xEB
*/

/*6.35
         dst数组                 src数组
     列0 列1 列2 列3           列0 列1 列2 列3
行0  m   h   h   h             m   h   h   h
行1  m   h   h   h             m   h   h   h
行2  m   h   h   h             m   h   h   h
行3  m   h   h   h             m   h   h   h
*/

/*6.39
A.写总数：16*16*4=1024
B.不命中的写总数：256
C.不命中率：25%
*/

/*6.43
25%
*/